automation/artillery.config.yml
config:
  target: "http://localhost:9000"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up phase
    - duration: 60
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 300
      arrivalRate: 50
      name: Sustained load
  plugins:
    metrics-by-endpoint: {}
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Storefront Browsing"
    flow:
      - get:
          url: "/store/products"
      - get:
          url: "/store/products/{{ productId }}"